0mdb/robot-buddy/esp32-reflex/sdkconfig.defaults
# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# Console over native USB CDC — TinyUSB composite device with proper cdc_acm
# Linux driver.  Secondary console disabled to prevent text leaking into the
# USB Serial/JTAG binary protocol stream.
CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y

# Logging (compile-time level; runtime suppressed via esp_log_level_set in app_main)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# FreeRTOS
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_HZ=1000

# Task watchdog — we'll register control_task with it
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=3
